#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.oidc.data.aws_iam_openid_connect_provider.this: Reading...
module.website.data.aws_iam_policy_document.website_iam_policy: Reading...
module.website.aws_cloudfront_origin_access_identity.s3_origin_identity[0]: Refreshing state... [id=E1GAHCXMB6HR0S]
aws_ecr_repository.app: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket.website_bucket: Refreshing state... [id=ui-forge-ai-studio]
module.website.data.aws_iam_policy_document.website_iam_policy: Read complete after 0s [id=115665691]
module.oidc.data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com]
module.oidc.data.aws_iam_policy_document.oidc: Reading...
module.oidc.data.aws_iam_policy_document.oidc: Read complete after 0s [id=3914002254]
module.oidc.aws_iam_role.this: Refreshing state... [id=github-actions-araltiparmak-ui-forge-ai-studio]
aws_ecr_repository_policy.app_policy: Refreshing state... [id=ui-forge-ai-studio]
aws_ecr_lifecycle_policy.app_lifecycle: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_public_access_block.example: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_website_configuration.website_configuration: Refreshing state... [id=ui-forge-ai-studio]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.website.aws_cloudfront_distribution.s3_distribution[0] will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                         = [
          + "ui.araltiparmak.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "ManagedBy" = "Terraform"
          + "Repo"      = "ui-forge-ai-studio"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "ui-forge-ai-studio"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "ui-forge-ai-studio.s3.eu-central-1.amazonaws.com"
          + origin_id                = "ui-forge-ai-studio"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E1GAHCXMB6HR0S"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:789798665829:certificate/e0fdbb0d-d6a5-4e64-88ba-46a39bf7d91e"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @araltiparmak, Action: `pull_request`*